Revit 2024 API
BuiltInFailures.SketchFailures.RebarEmptySketch Property
 Rebar Sketch is empty. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarEmptySketch { get; }
Visual Basic
Public Shared ReadOnly Property RebarEmptySketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarEmptySketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace